BenchmarkResults/LatencyComparision/GRACE/results.txt
/Users/pandey/.sdkman/candidates/java/current/bin/java  -classpath /Users/pandey/work/YCSB/conf:/Users/pandey/work/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/Users/pandey/work/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/Users/pandey/work/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/Users/pandey/work/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/Users/pandey/work/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/Users/pandey/work/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/Users/pandey/work/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/commons-logging-1.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/Users/pandey/work/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/Users/pandey/work/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/Users/pandey/work/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/Users/pandey/work/YCSB/grace/target/dependency/guava-31.1-jre.jar:/Users/pandey/work/YCSB/grace/target/dependency/hppc-0.7.1.jar:/Users/pandey/work/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/pandey/work/YCSB/grace/target/dependency/ivy-2.5.1.jar:/Users/pandey/work/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/Users/pandey/work/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/Users/pandey/work/YCSB/grace/target/dependency/javatuples-1.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/Users/pandey/work/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/Users/pandey/work/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/Users/pandey/work/YCSB/grace/target/dependency/jline-2.14.6.jar:/Users/pandey/work/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/Users/pandey/work/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/Users/pandey/work/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/Users/pandey/work/YCSB/grace/target/dependency/noggit-0.8.jar:/Users/pandey/work/YCSB/grace/target/dependency/picocli-4.3.2.jar:/Users/pandey/work/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/Users/pandey/work/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/Users/pandey/work/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/Users/pandey/work/YCSB/grace/target/dependency/spatial4j-0.8.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p maxexecutiontime=60 -p threadcount=1
Data integrity is enabled.
GraceClient  Created
Starting GRACE client
{deleteproportion=1, recordcount=100000, operationcount=2000000, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, DBTYPE=neo4j, updateproportion=1, HOSTURI=http://localhost:3000, dotransactions=true, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=60, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: neo4j
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 60005
[OVERALL], Throughput(ops/sec), 435.630364136322
[TOTAL_GCS_G1_Young_Generation], Count, 9
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 48
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0799933338888426
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 48
[TOTAL_GC_TIME_%], Time(%), 0.0799933338888426
[REMOVE_VERTEX], Operations, 1768
[REMOVE_VERTEX], AverageLatency(us), 2133.9128959276018
[REMOVE_VERTEX], MinLatency(us), 1407
[REMOVE_VERTEX], MaxLatency(us), 16911
[REMOVE_VERTEX], 50thPercentileLatency(us), 1930
[REMOVE_VERTEX], 95thPercentileLatency(us), 3289
[REMOVE_VERTEX], 99thPercentileLatency(us), 6267
[REMOVE_VERTEX], Return=OK, 1768
[GET_EDGE_WITH_PROPERTY], Operations, 1804
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 1490.2832594235033
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 759
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 10015
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 1362
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 2119
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 4131
[GET_EDGE_WITH_PROPERTY], Return=OK, 1804
[ADD_EDGE], Operations, 1845
[ADD_EDGE], AverageLatency(us), 5503.026016260163
[ADD_EDGE], MinLatency(us), 1131
[ADD_EDGE], MaxLatency(us), 115647
[ADD_EDGE], 50thPercentileLatency(us), 2803
[ADD_EDGE], 95thPercentileLatency(us), 43999
[ADD_EDGE], 99thPercentileLatency(us), 46943
[ADD_EDGE], Return=OK, 1845
[ADD_VERTEX], Operations, 1813
[ADD_VERTEX], AverageLatency(us), 2203.1213458356315
[ADD_VERTEX], MinLatency(us), 879
[ADD_VERTEX], MaxLatency(us), 77247
[ADD_VERTEX], 50thPercentileLatency(us), 2101
[ADD_VERTEX], 95thPercentileLatency(us), 3849
[ADD_VERTEX], 99thPercentileLatency(us), 7163
[ADD_VERTEX], Return=OK, 1813
[GET_VERTEX_WITH_PROPERTY], Operations, 1905
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 1765.4682414698163
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 1010
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 22559
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 1566
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 2705
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 6683
[GET_VERTEX_WITH_PROPERTY], Return=OK, 1905
[REMOVE_EDGE_PROPERTY], Operations, 1808
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 2893.535951327434
[REMOVE_EDGE_PROPERTY], MinLatency(us), 894
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 49375
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 2687
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 4283
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 7655
[REMOVE_EDGE_PROPERTY], Return=OK, 1808
[REMOVE_EDGE], Operations, 1804
[REMOVE_EDGE], AverageLatency(us), 2430.4085365853657
[REMOVE_EDGE], MinLatency(us), 887
[REMOVE_EDGE], MaxLatency(us), 25631
[REMOVE_EDGE], 50thPercentileLatency(us), 2233
[REMOVE_EDGE], 95thPercentileLatency(us), 3689
[REMOVE_EDGE], 99thPercentileLatency(us), 6595
[REMOVE_EDGE], Return=OK, 1804
[GET_EDGE_LABELS], Operations, 1844
[GET_EDGE_LABELS], AverageLatency(us), 1617.101409978308
[GET_EDGE_LABELS], MinLatency(us), 925
[GET_EDGE_LABELS], MaxLatency(us), 27807
[GET_EDGE_LABELS], 50thPercentileLatency(us), 1381
[GET_EDGE_LABELS], 95thPercentileLatency(us), 2409
[GET_EDGE_LABELS], 99thPercentileLatency(us), 5799
[GET_EDGE_LABELS], Return=OK, 1844
[GET_VERTEX_COUNT], Operations, 1890
[GET_VERTEX_COUNT], AverageLatency(us), 1532.3243386243387
[GET_VERTEX_COUNT], MinLatency(us), 852
[GET_VERTEX_COUNT], MaxLatency(us), 21231
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 1336
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 2371
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 5299
[GET_VERTEX_COUNT], Return=OK, 1890
[REMOVE_VERTEX_PROPERTY], Operations, 1855
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 2355.4479784366576
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 1502
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 29087
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 2091
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 3685
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 6651
[REMOVE_VERTEX_PROPERTY], Return=OK, 1855
[GET_EDGES_WITH_LABEL], Operations, 1925
[GET_EDGES_WITH_LABEL], AverageLatency(us), 1554.0072727272727
[GET_EDGES_WITH_LABEL], MinLatency(us), 869
[GET_EDGES_WITH_LABEL], MaxLatency(us), 28591
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 1360
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 2451
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 5219
[GET_EDGES_WITH_LABEL], Return=OK, 1925
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6.0
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 6
[CLEANUP], 50thPercentileLatency(us), 6
[CLEANUP], 95thPercentileLatency(us), 6
[CLEANUP], 99thPercentileLatency(us), 6
[SET_EDGE_PROPERTY], Operations, 1815
[SET_EDGE_PROPERTY], AverageLatency(us), 2879.5421487603307
[SET_EDGE_PROPERTY], MinLatency(us), 927
[SET_EDGE_PROPERTY], MaxLatency(us), 23903
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 2701
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 4171
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 7771
[SET_EDGE_PROPERTY], Return=OK, 1815
[SET_VERTEX_PROPERTY], Operations, 1823
[SET_VERTEX_PROPERTY], AverageLatency(us), 2324.2122874382885
[SET_VERTEX_PROPERTY], MinLatency(us), 1507
[SET_VERTEX_PROPERTY], MaxLatency(us), 15391
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 2109
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 3497
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 6111
[SET_VERTEX_PROPERTY], Return=OK, 1823
[GET_EDGE_COUNT], Operations, 1893
[GET_EDGE_COUNT], AverageLatency(us), 1538.0972002113049
[GET_EDGE_COUNT], MinLatency(us), 815
[GET_EDGE_COUNT], MaxLatency(us), 24591
[GET_EDGE_COUNT], 50thPercentileLatency(us), 1361
[GET_EDGE_COUNT], 95thPercentileLatency(us), 2321
[GET_EDGE_COUNT], 99thPercentileLatency(us), 4551
[GET_EDGE_COUNT], Return=OK, 1893